app/controllers/jobs_controller.rb

SELECT "job_subcategories".* FROM "job_subcategories" INNER JOIN "job_subcategories_jobs" ON "job_subcategories"."id" = "job_subcategories_jobs"."job_subcategory_id" WHERE "job_subcategories_jobs"."job_id" = 1
---
  def search
    unless params[:category]
      @search_results = Job.search_by_job_title(params[:job_title]).filter_by_address(params[:address]).filter_by_days(params[:days]).sort_by(params[:sort]).active
      @jobs = @search_results.page(params[:page]).per_page(10)
    else
      @subcategories = JobCategory.where(slug: params[:category]).first.subcategories
      @search_results = @subcategories.map { |sc| sc.jobs }.flatten